In [1]:
import pandas as pd

# Creating a Series with default index
data = [4, 7, -5, 3]
s1 = pd.Series(data)
print(s1)

# Creating a Series with a custom index
index = ['a', 'b', 'c', 'd']
s2 = pd.Series(data, index=index)
print(s2)

0    4
1    7
2   -5
3    3
dtype: int64
a    4
b    7
c   -5
d    3
dtype: int64

In [2]:
import pandas as pd

s1 = pd.Series([25, 30, 35, 40], name='age')
s2 = pd.Series(['New York', 'San Francisco', 'Los Angeles', 'Chicago'], name='city')

df = pd.concat([s1, s2], axis=1)
print(df)

   age           city
0   25       New York
1   30  San Francisco
2   35    Los Angeles
3   40        Chicago

In [4]:
import pandas as pd

file_path = 'titles.csv'
df = pd.read_csv(file_path)
print(df.head())

         id                                title   type  \
0  ts300399  Five Came Back: The Reference Films   SHOW
1   tm84618                          Taxi Driver  MOVIE
2  tm154986                          Deliverance  MOVIE
3  tm127384      Monty Python and the Holy Grail  MOVIE
4  tm120801                      The Dirty Dozen  MOVIE

                                         description  release_year  \
0  This collection includes 12 World War II-era p...          1945
1  A mentally unstable Vietnam War veteran works ...          1976
2  Intent on seeing the Cahulawassee River before...          1972
3  King Arthur, accompanied by his squire, recrui...          1975
4  12 American military prisoners in World War II...          1967

  age_certification  runtime                                       genres  \
0             TV-MA       51                            ['documentation']
1                 R      114                           ['drama', 'crime']
2                 R      109  ['drama', 'action', 'thriller', 'european']
3                PG       91              ['fantasy', 'action', 'comedy']
4               NaN      150                            ['war', 'action']

  production_countries  seasons    imdb_id  imdb_score  imdb_votes  \
0               ['US']      1.0        NaN         NaN         NaN
1               ['US']      NaN  tt0075314         8.2    808582.0
2               ['US']      NaN  tt0068473         7.7    107673.0
3               ['GB']      NaN  tt0071853         8.2    534486.0
4         ['GB', 'US']      NaN  tt0061578         7.7     72662.0

   tmdb_popularity  tmdb_score
0            0.600         NaN
1           40.965       8.179
2           10.010       7.300
3           15.461       7.811
4           20.398       7.600

In [7]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

file_path = 'output_data.xlsx'
df.to_excel(file_path, index=False, sheet_name='Sheet1')

In [8]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

file_path = 'output_data.json'
df.to_json(file_path, orient='records')

In [9]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'age': [25, 30, 35, 40, 45, 50],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami', 'Boston']
}
df = pd.DataFrame(data)

# Display the first 3 rows
df.head(3)

# Display the last 2 rows
df.tail(2)

    name  age    city
4    Eva   45   Miami
5  Frank   50  Boston

In [10]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])

# Select a single row by index label
print(df.loc['A'])

# Select multiple rows by index labels
print(df.loc[['A', 'C']])

# Select a single value using row and column labels
print(df.loc['A', 'city'])

# Slice rows and select specific columns
print(df.loc['A':'C', ['name', 'age']])

name       Alice
age           25
city    New York
Name: A, dtype: object
      name  age         city
A    Alice   25     New York
C  Charlie   35  Los Angeles
New York
      name  age
A    Alice   25
B      Bob   30
C  Charlie   35

In [12]:
#Pandas provides several methods to compute descriptive statistics of a DataFrame, such as describe(), mean(), median(), min(), max(), std(), sum(), and count().

import pandas as pd

data = {
    'age': [25, 30, 35, 40],
    'income': [50000, 55000, 60000, 65000]
}
df = pd.DataFrame(data)

# Generate summary statistics
print(df.describe())

# Compute the mean
print(df.mean())

# Compute the median
print(df.median())

# Find the minimum and maximum values
print(df.min())
print(df.max())

# Compute the standard deviation
print(df.std())

# Calculate the sum and count
print(df.sum())
print(df.count())

             age        income
count   4.000000      4.000000
mean   32.500000  57500.000000
std     6.454972   6454.972244
min    25.000000  50000.000000
25%    28.750000  53750.000000
50%    32.500000  57500.000000
75%    36.250000  61250.000000
max    40.000000  65000.000000
age          32.5
income    57500.0
dtype: float64
age          32.5
income    57500.0
dtype: float64
age          25
income    50000
dtype: int64
age          40
income    65000
dtype: int64
age          6.454972
income    6454.972244
dtype: float64
age          130
income    230000
dtype: int64
age       4
income    4
dtype: int64

In [13]:
import pandas as pd

data = {
    'department': ['HR', 'HR', 'IT', 'IT', 'Sales', 'Sales'],
    'employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'salary': [50000, 55000, 60000, 62000, 70000, 72000]
}
df = pd.DataFrame(data)

# Group by the 'department' column and compute the total salary
grouped_df = df.groupby('department')['salary'].sum()
print(grouped_df)

# Group by the 'department' column and compute the average salary
grouped_df = df.groupby('department')['salary'].mean()
print(grouped_df)

# Group by the 'department' column and count the number of employees
grouped_df

department
HR       105000
IT       122000
Sales    142000
Name: salary, dtype: int64
department
HR       52500.0
IT       61000.0
Sales    71000.0
Name: salary, dtype: float64

department
HR       52500.0
IT       61000.0
Sales    71000.0
Name: salary, dtype: float64

In [15]:
# 1 Import the necessary libraries and load the dataset.
import pandas as pd

url = "vgsales.csv"
df = pd.read_csv(url)

# 2 Display the first 10 rows of the dataset.

df.head(10)

# 3 Display the shape and basic information about the dataset.
print(df.shape)
print(df.info())

# 4 Check for missing data and handle it appropriately.
print(df.isna().sum())
df = df.dropna()

# 5 Display the top 5 video games by global sale

df_top5_global = df.nlargest(5, 'Global_Sales')
print(df_top5_global)

# 6 Calculate the total sales in North America for the 'Action' genre.
action_sales_na = df[df['Genre'] == 'Action']['NA_Sales'].sum()
print(action_sales_na)

# 7 Find the top 3 publishers by global sales.
top3_publishers = df.groupby('Publisher')['Global_Sales'].sum().nlargest(3)
print(top3_publishers)


# 8 Calculate the average sales in Europe for the 'Shooter' genre.
shooter_avg_sales_eu = df[df['Genre'] == 'Shooter']['EU_Sales'].mean()
print(shooter_avg_sales_eu)


# 9 Find the game with the highest sales in Japan in the 'Sports' genre.
highest_jp_sports = df[df['Genre'] == 'Sports'].nlargest(1, 'JP_Sales')
print(highest_jp_sports)

(16598, 11)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB
None
Rank              0
Name              0
Platform          0
Year            271
Genre             0
Publisher        58
NA_Sales          0
EU_Sales          0
JP_Sales          0
Other_Sales       0
Global_Sales      0
dtype: int64
   Rank                      Name Platform    Year         Genre Publisher  \
0     1                Wii Sports      Wii  2006.0        Sports  Nintendo
1     2         Super Mario Bros.      NES  1985.0      Platform  Nintendo
2     3            Mario Kart Wii      Wii  2008.0        Racing  Nintendo
3     4         Wii Sports Resort      Wii  2009.0        Sports  Nintendo
4     5  Pokemon Red/Pokemon Blue       GB  1996.0  Role-Playing  Nintendo

   NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0     41.49     29.02      3.77         8.46         82.74
1     29.08      3.58      6.81         0.77         40.24
2     15.85     12.88      3.79         3.31         35.82
3     15.75     11.01      3.28         2.96         33.00
4     11.27      8.89     10.22         1.00         31.37
861.7700000000001
Publisher
Nintendo           1784.43
Electronic Arts    1093.39
Activision          721.41
Name: Global_Sales, dtype: float64
0.24216068642745708
   Rank        Name Platform    Year   Genre Publisher  NA_Sales  EU_Sales  \
0     1  Wii Sports      Wii  2006.0  Sports  Nintendo     41.49     29.02

   JP_Sales  Other_Sales  Global_Sales
0      3.77         8.46         82.74